[
  {
    "type": "Verse 1",
    "lines": [
      {
        "id": 1,
        "text": "Uh, me and my niggas tryna get it, ya bish (Ya bish, ya bish)\nHit the house lick, tell me, is you with it, ya bish? (Ya bish, ya bish)",
        "range": {
          "start": 1,
          "end": 2
        },
        "annotations": [
          {
            "text": "Kendrick grew up in Compton, CA which is notoriously impoverished. Growing up in that environment gave Kendrick the motivation to do whatever it took to pull himself out of poverty. “It” could refer to everything and anything including money, power, and respect.\n\n“bish” = “bitch”\n\nhttps://twitter.com/kendricklamar/statuses/260442741497028609\n\n\n\n\n\n\n\nThe various meanings of ya bish are explored here. It has its own website, which includes apparel, ya bish.\n\n\n\n“Hit a lick” means armed robbery, and it’s a term Kendrick has used regularly in his music:\n\nFuck am I ‘posed to do when I’m lookin’ at walkin' licks?\nThe constant big money talk ‘bout the mansion and foreign whips\n\nIt’s also the jumping point for his narrative on “The Art of Peer Pressure”",
            "verified": false,
            "votes_total": 249,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Home invasion was persuasive (Was persuasive, was persuasive)\nFrom nine to five, I know it's vacant, ya bish (Ya bish, ya bish)",
        "range": {
          "start": 3,
          "end": 4
        },
        "annotations": [
          {
            "text": "Home invasion was an appealing lick. Kendrick knows the house will be vacant from 9 to 5 as that is when most people are working, making the urge to rob the home that much more powerful. Note how Kendrick mentions “nine to five” during his plot for house robbery, this contrasts the homeowners who work honest jobs and Kendrick and his friends who are about to make easy money by robbing their home.\n\nThis line refers to the home invasion in “The Art of Peer Pressure”.\n\nHome Invasion also is an Ice-T album from 1993.\n“Money Trees” contains many references you can find later in the song: E-40, Halle Berry, Louie Burger and so on…",
            "verified": false,
            "votes_total": 134,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "Dreams of livin' life like rappers do (Like rappers do, like rappers do)\nBack when condom wrappers wasn't cool (They wasn't cool, they wasn't cool)",
        "range": {
          "start": 5,
          "end": 6
        },
        "annotations": [
          {
            "text": "Here, the phrase “condom wrappers” is used as a homonym, alongside “condom rappers.” The origins of the latter term are disputed, but it has been theorized that “condom rappers” are either ones who rap incessantly about sex or artists from the ‘80s who warned against the dangers of unprotected intercourse.\n\nKendrick reminisces about when he would dream of being as successful as the rappers he listened to. Back then, using condoms wasn’t considered “cool,” as the dangers of STDs were not very well known. At the time, Compton hip-hop was not yet famous—Compton was put on the map starting with N.W.A, who released their debut album Straight Outta Compton in 1988. Given the possible reference to 1980s hip-hop and condoms, this could also be a subtle shout-out to fellow Compton rapper and N.W.A member Eazy-E, who died from complications of AIDS in 1995.\n\nThe Notorious B.I.G. also mentioned this cultural transition from a contraception-averse society to wearing condoms due to the dangers of disease on his September 1994 track, “The What”:\n\nI used to get feels on a bitch\nNow I throw shields on the dick, to stop me from that HIV shit",
            "verified": false,
            "votes_total": 322,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "I fucked Sherane and went to tell my bros (Tell my bros, tell my bros)\nThen Usher Raymond, \"Let It Burn\" came on (\"Let Burn\" came on, \"Let Burn\" came on)",
        "range": {
          "start": 7,
          "end": 8
        },
        "annotations": [
          {
            "text": "That was a metaphor for both. Not saying that I actually had an STD.  But that is the consequences I could have gotten messing with somebody like Sherane.",
            "verified": true,
            "votes_total": 1033,
            "pinnedRole": "Artist"
          },
          {
            "text": "Kendrick is pointing out how ironic it is that when he told his friends about having unprotected sex with Sherane during the album’s intro, “Let it Burn” by Usher came on the radio. This also provides the time period of the story, indirectly, as the song was released in July 2004.\n\nThe “burn” is a possible reference to an STD and ties in with the “condom wrappers” line from earlier.\n\nThis isn’t the first time this play on words has been used. Kanye said something similar on his August 2005 track, “Gone”:\n\nCaught something on the Usher tour he had to let it burn",
            "verified": false,
            "votes_total": 272,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "Hot sauce all in our Top Ramen, ya bish (Ya bish, ya bish)",
        "range": {
          "start": 9,
          "end": 9
        },
        "annotations": [
          {
            "text": "Ramen noodles are very famous cheap eats.\n\n\n\nThis is a continuation of the burn from fucking Sherane “ya bish.” Hot sauce in his noodles is a euphemism for an STD that burned his “noodle.”\n\nThere’s the literal meaning to adding hot sauce to Top Ramen to make them more palatable. But metaphorically, it’s also a way of improving on shitty situation by adding a certain condiment to make the situation easier to handle. That seems to be the theme of this song, which is about escaping poverty, mental depravity and the trappings of the hood.\n\nAlso a play on words as pronunciation sounds like “top rhymin'”",
            "verified": false,
            "votes_total": 270,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "Park the car, then we start rhymin', ya bish (Ya bish, ya bish)\nThe only thing we had to free our mind (Free our mind, free our mind)",
        "range": {
          "start": 10,
          "end": 11
        },
        "annotations": [
          {
            "text": "Freestyling is used by Kendrick and his friends to escape rough life in Compton. This line refers to ‘Backseat Freestyle’.",
            "verified": false,
            "votes_total": 121,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 7,
        "text": "Then freeze that verse when we see dollar signs (See dollar signs, see dollar signs)",
        "range": {
          "start": 12,
          "end": 12
        },
        "annotations": [
          {
            "text": "Despite freestyle exercise being the one escape from their dysfunctional reality, Kendrick Lamar and his friends would be easily distracted by an opportunity for some quick cash; often through illegal activity. Another interpretation is that they stop trading verses once they see someone walking down the street who looks like they have money, as implied by the next two lines.\n\nhttps://youtu.be/pn7xdlnMzfQ?t=57s\n\nWatch how Ali freezes the track at this exact point in the song for dramatic effect, during their first ever live performance of “Money Trees” in New York on October 23, 2012—allowing Kendrick to emphasize his homies' priorities.",
            "verified": false,
            "votes_total": 147,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 8,
        "text": "You lookin' like an easy come-up, ya bish (Ya bish, ya bish)",
        "range": {
          "start": 13,
          "end": 13
        },
        "annotations": [
          {
            "text": "An “easy come-up” is a mark—an easy robbery target. Kendrick’s desire for wealth tempts him to steal from someone with a lot of cash, and no street experience. In October 2012, Kendrick told Complex:\n\nThat was the mind state of thinking everything is about a dollar. That’s where we were at at the time. We didn’t care about nothing else truthfully.\n\nKendrick was never involved in illegal activities, but some of his friends and family were—two of his uncles did time for robbery.",
            "verified": false,
            "votes_total": 123,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 9,
        "text": "A silver spoon, I know you come from, ya bish (Ya bish, ya bish)\nAnd that's a lifestyle that we never knew (We never knew, we never knew)",
        "range": {
          "start": 14,
          "end": 15
        },
        "annotations": [
          {
            "text": "Being “born with a silver spoon in your mouth” means you come from a well off family.  K.Dot and the homies don’t know what that life is like.\n\n\n\nAlso, young Kendrick is justifying robbing this person. They inherited opportunity. That is something Kendrick and his friends have never had. They garner resentment toward the well off, and outlet that through robbing them.",
            "verified": false,
            "votes_total": 169,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 10,
        "text": "Go at a reverend for the revenue",
        "range": {
          "start": 16,
          "end": 16
        },
        "annotations": [
          {
            "text": "This line speaks to their ‘by any means necessary’ mentality. They would even rob a person as upstanding as a reverend to get money.\n\nPrime example: Pastor Winans was being beaten, robbed, and car-jacked at a gas station in Detroit back in May of 2012.\n\nhttp://www.youtube.com/watch?v=-rnkd5EAk3c\n\nProfit is revenue minus the cost. With profit being the money made and the costs his sins, he could be going to a reverend to remove the costs.",
            "verified": false,
            "votes_total": 164,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "It go Halle Berry or hallelujah",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "https://soundcloud.com/rapgenius/kendrick-on-it-go-halle-berry\nYou can either go right, or you can go left and get crazy with us. Basically just saying we throw the evils of the world in the air. Now, K. Dot, you can either get with the program or you don’t have to, it’s whatever. Of course, hallelujah being the more good in me and Halle Berry being the actual vice of what’s going down – the lust for the money, the lust for this mission we are about to go on. Pick your poison, tell me what you’re doing. But when you tell me, tell me right now. We ain’t got time to wait.",
            "verified": true,
            "votes_total": 1731,
            "pinnedRole": "Artist"
          },
          {
            "text": "Kendrick is questioning whether his listeners pick worldly pleasures or a principled, religious life. Southern artist Big KRIT portrayed this very dilemma with the artwork of his March 2012 mixtape 4Eva N A Day.\n\nThis could also be a metaphor for our civilization’s future rather than just an individual. Will we carry on with a Hollywood-centered mindset or an enlightened one? Will we worship celebrities or God?\n\nThis concept goes all the way back to St. Augustine. In his 5th century philosophical piece, The City of God, he portrays all of human history and civilization as a conflict between the ‘City of Man’ and the ‘City of God.’ It was written shortly after Rome was sacked by Visigoths, but Augustine counsels the faithful not to worry about the fate of the material world, but rather, to be concerned with the heavenly world—the New Jerusalem.",
            "verified": false,
            "votes_total": 450,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Pick your poison, tell me what you doin'",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "Halle Berry is an Oscar-winning actor, but she’s also a veritable sex symbol. Kendrick equates her name with worldly pleasure, contrasting it with the similar-sounding biblical phrase, “Hallelujah,” meaning “praise the Lord” in Hebrew.\n\nWhether it’s pussy or religion, Kendrick illustrates that dedicating one’s life to either can lead to suffering. This is a direct symbol for the “poison” Kendrick had to endure by making the choice to follow salvation in the midst of the darkness that defines Compton.",
            "verified": false,
            "votes_total": 231,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "Everybody gon' respect the shooter\nBut the one in front of the gun lives forever\n(The one in front of the gun, forever)",
        "range": {
          "start": 3,
          "end": 5
        },
        "annotations": [
          {
            "text": "Although the shooter may get temporary attention from committing the murder, it’s the victim who is remembered and honored forever. Kendrick’s friend Dave dies in a shootout in the outro of “Swimming Pools (Drank)” and is immortalized in the first verse from “Sing About Me, I’m Dying of Thirst.” These lyrics are reflective of Lamar’s reality, who expanded on the lines in a 2012 interview with The Guardian:\n\nYou don’t hear no artists from Compton showing vulnerability. You always hear about the person pulling the trigger. You never hear about the one in front of it. That’s the most interesting story to me.\n\nKendrick might have been inspired by Nas when writing these lines, as Nas similarly covered this same idea in 1994’s “One Love” off Illmatic:\n\n‘Cause when the pistol blows\nThe one that’s murdered be the cool one\n\nThis can also be seen as an analogy to suggest that a controlling regime (the shooter) gets respect (obedience), but “the one in front of the gun” (the people) will always exist, no matter what threats are given. It’s worth noting that Lamar’s lines are similar to the famed last words of civil rights activist Huey Newton:\n\nYou can kill my body, but you can’t kill my soul. My soul will live forever!\n\nThis could also be interpreted as a statement on martyrdom in general given the heavy Christian themes of the album. There are countless examples throughout history of the inverse Jay-Z—respecting the one who got shot over the shooter.",
            "verified": false,
            "votes_total": 858,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "And I been hustlin' all day, this-a-way, that-a-way\nThrough canals and alleyways, just to say",
        "range": {
          "start": 6,
          "end": 7
        },
        "annotations": [
          {
            "text": "Kendrick and his crew have been striving to get money from sun-up-to-sun-down in the poverty-stricken community that is Compton, California. These simple lines help to emphasize the rat race of daily life taking the listener into the geographic recesses of the underworld.\n\nHis delivery of “this-a-way, that-a-way” is similar to that of Mac Shawn on the chorus of E-40’s March 1995 track, “Sideaways.” Kendrick references E-40 in the second verse.",
            "verified": false,
            "votes_total": 114,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "Money trees is the perfect place for shade\nAnd that's just how I feel, nah, nah",
        "range": {
          "start": 8,
          "end": 9
        },
        "annotations": [
          {
            "text": "Having a lot of money is the most comfortable place to be. Kendrick is trying to suggest that although he feels passionately about the above statements, having a large amount of money shades him from facing hardships that many people encounter today.\n\n\n\nYou have two options: pursue money or pursue meaning. Both can get you rich if you hustle hard enough. However, the pursuit of purely money is just a temporary place for security. This also implies that money and wealth is extremely susceptible to evil (might make you do some shady things).\n\nLater in the album, Kendrick tells us that they are ‘dying of thirst’. Literally speaking, shade can serve to temporally subdue their need to be saved, but does not fix the problem.",
            "verified": false,
            "votes_total": 364,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "A dollar might just fuck your main bitch\nThat's just how I feel, nah\nA dollar might say fuck them niggas that you came with\nThat's just how I feel, nah, nah\nA dollar might just make that lane switch\nThat's just how I feel, nah\nA dollar might turn to a million and we all rich\nThat's just how I feel",
        "range": {
          "start": 10,
          "end": 17
        },
        "annotations": [
          {
            "text": "Some people’s desire for money will, ironically, leave them exhausted, disillusioned, or alone—not to mention broke. Others may wander from their faith or loyalty. This notion coincides with the “Halle Berry” or “Hallelujah” theme found earlier in the chorus.\n\nThe closing lines, however, evoke winning the lottery; where the purchase of an inexpensive ticket can result in millions of dollars. This blurs the lines between the misconception that “money is the root of all evil” and its ability to change lives. In actuality, it is the love of money that is considered to be evil, according to 1 Timothy 6:10:\n\nFor the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\n\n\n\nThese bars might also allude to Dolemite, an April 1975 blaxploitation film about a rebellious pimp.",
            "verified": false,
            "votes_total": 340,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 2",
    "lines": [
      {
        "id": 1,
        "text": "Dreams of livin' life like rappers do (Like rappers do, like rappers do)\nBump that new E-40 after school (Way after school, way after school)\nYou know, \"Big Ballin' With My Homies\" (My homies)\nEarl Stevens had us thinkin' rational (Thinkin' rational, that's rational)",
        "range": {
          "start": 1,
          "end": 4
        },
        "annotations": [
          {
            "text": "“Big Ballin' With My Homies” is a song off of Charlie Hustle: The Blueprint of a Self-Made Millionaire by West Coast legend E-40, real name Earl Stevens. The album made Kendrick’s list of 25 Favorite Albums, which he used to play after school.\n\n\n\nE-40 usually portrays a luxurious lifestyle in his music, and since Kendrick and his homies are under his music influence, obtaining money seems more than “rational” to them. The usage of “rational” also takes a ironical meaning; pointing out how rap songs gave him and his homies un-realistic ambitions of wealth, and with California having the highest poverty rate in the US, it’s something that’s almost impossible to achieve.",
            "verified": false,
            "votes_total": 252,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Back to reality, we poor, ya bish (Ya bish, ya bish)\nAnother casualty at war, ya bish (Ya bish, ya bish)\nTwo bullets in my Uncle Tony head (My Tony head, my Tony head)\nHe said one day I'll be on tour, ya bish (Ya bish, ya bish)\nThat Louis Burgers never be the same (Won't be the same, won't be the same)\nA Louis belt'll never ease that pain (Won't ease that pain, won't ease that pain)",
        "range": {
          "start": 5,
          "end": 10
        },
        "annotations": [
          {
            "text": "After the lavish lifestyle ideology propelled by the music, who’s influence he was under, Kendrick is back among the cruel reality of Compton,  a place where rivalry between gangs causes casualties, similar to a war. A victim of the the ongoing violence was his Uncle Tony, killed at Louis Burgers. Not only is Kendrick poor in a monetary sense, he and his crew are now pouring liquor on the curb in memory of his Uncle Tony.\n\nKendrick’s family have always been portrayed as supportive, but here his Uncle displays the kind of encouragement a lot of rappers and entertainers never experience; a belief in his abilities.\n\nThe shock of losing a supportive figure puts a permanent stain on that Louis Burgers, and exemplifies the deep ties that Kendrick has to his city. His “dreams of living life like rappers do” are interrupted by the pain that gang culture brings, and that pain is not eased by expensive clothing.",
            "verified": false,
            "votes_total": 255,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "But I'ma purchase when that day is jerkin' (That day is jerkin', day is jerkin')",
        "range": {
          "start": 11,
          "end": 11
        },
        "annotations": [
          {
            "text": "When that day is troubling him or “jerkin'” (i.e. the sad memories get to him), he’s gonna buy material objects in hope that they might ease the pain momentarily.\n\nMaterial objects won’t heal him, but when he’s paid (now!) he’ll cop it anyway. It’s part of the victory of his perseverance.\n\nNotice the wordplay on “jerking” and “belt” as a belt can be used to stop something from jerking in the literal sense.",
            "verified": false,
            "votes_total": 84,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "Pull off at Church's with Pirellis skrrtin' (Pirellis skrrtin', Pirellis skrrtin')",
        "range": {
          "start": 12,
          "end": 12
        },
        "annotations": [
          {
            "text": "Church’s Chicken is a popular fast food chain originally from Texas, specializing in fried chicken. They have nearly a dozen franchises in and around the Los Angeles area.\n\n\n\nPirelli is a tire brand based in Milan, Italy.",
            "verified": false,
            "votes_total": 93,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "Gang signs out the window, ya bish (Ya bish, ya bish)\nHopin' all of 'em offend you, ya bish (Ya bish, ya bish)",
        "range": {
          "start": 13,
          "end": 14
        },
        "annotations": [
          {
            "text": "Gang signs are meant to intimidate and offend the people that are viewing them pass by. There’s a nonchalance within the line that is the sentiment of the youth. It’s the uncaring arrogance we all displayed, that “IDGAF” attitude. Those are exactly the sentiments within Kendrick as he rolls around with his homies. There’s some irony portrayed because the song before is The Art of Peer Pressure. He wasn’t a gang banger but he still threw up gang signs because it was what the homies were doing.\n\n\n\nThese bars and one before, are all related. It’s the mentality of how Kendrick deals with troubled days when he can’t ease the pain of his past. In one way or another, he lashes out and acts recklessly (in actions or money).",
            "verified": false,
            "votes_total": 139,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "They say your hood is a pot of gold (A pot of gold, a pot of gold)\nAnd we gon' crash it when nobody's home",
        "range": {
          "start": 15,
          "end": 16
        },
        "annotations": [
          {
            "text": "Wealthy neighborhoods are essentially “pots of gold” because of how many valuables can be stolen from them. For example, the house lick in the third verse of “The Art Of Peer Pressure” describes Kendrick and his friends robbing a house that they had been watching for 2 months.",
            "verified": false,
            "votes_total": 155,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "It go Halle Berry or hallelujah",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "https://soundcloud.com/rapgenius/kendrick-on-it-go-halle-berry\nYou can either go right, or you can go left and get crazy with us. Basically just saying we throw the evils of the world in the air. Now, K. Dot, you can either get with the program or you don’t have to, it’s whatever. Of course, hallelujah being the more good in me and Halle Berry being the actual vice of what’s going down – the lust for the money, the lust for this mission we are about to go on. Pick your poison, tell me what you’re doing. But when you tell me, tell me right now. We ain’t got time to wait.",
            "verified": true,
            "votes_total": 1731,
            "pinnedRole": "Artist"
          },
          {
            "text": "Kendrick is questioning whether his listeners pick worldly pleasures or a principled, religious life. Southern artist Big KRIT portrayed this very dilemma with the artwork of his March 2012 mixtape 4Eva N A Day.\n\nThis could also be a metaphor for our civilization’s future rather than just an individual. Will we carry on with a Hollywood-centered mindset or an enlightened one? Will we worship celebrities or God?\n\nThis concept goes all the way back to St. Augustine. In his 5th century philosophical piece, The City of God, he portrays all of human history and civilization as a conflict between the ‘City of Man’ and the ‘City of God.’ It was written shortly after Rome was sacked by Visigoths, but Augustine counsels the faithful not to worry about the fate of the material world, but rather, to be concerned with the heavenly world—the New Jerusalem.",
            "verified": false,
            "votes_total": 450,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Pick your poison, tell me what you doin'",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "Halle Berry is an Oscar-winning actor, but she’s also a veritable sex symbol. Kendrick equates her name with worldly pleasure, contrasting it with the similar-sounding biblical phrase, “Hallelujah,” meaning “praise the Lord” in Hebrew.\n\nWhether it’s pussy or religion, Kendrick illustrates that dedicating one’s life to either can lead to suffering. This is a direct symbol for the “poison” Kendrick had to endure by making the choice to follow salvation in the midst of the darkness that defines Compton.",
            "verified": false,
            "votes_total": 231,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "Everybody gon' respect the shooter\nBut the one in front of the gun lives forever\n(The one in front of the gun, forever)",
        "range": {
          "start": 3,
          "end": 5
        },
        "annotations": [
          {
            "text": "Although the shooter may get temporary attention from committing the murder, it’s the victim who is remembered and honored forever. Kendrick’s friend Dave dies in a shootout in the outro of “Swimming Pools (Drank)” and is immortalized in the first verse from “Sing About Me, I’m Dying of Thirst.” These lyrics are reflective of Lamar’s reality, who expanded on the lines in a 2012 interview with The Guardian:\n\nYou don’t hear no artists from Compton showing vulnerability. You always hear about the person pulling the trigger. You never hear about the one in front of it. That’s the most interesting story to me.\n\nKendrick might have been inspired by Nas when writing these lines, as Nas similarly covered this same idea in 1994’s “One Love” off Illmatic:\n\n‘Cause when the pistol blows\nThe one that’s murdered be the cool one\n\nThis can also be seen as an analogy to suggest that a controlling regime (the shooter) gets respect (obedience), but “the one in front of the gun” (the people) will always exist, no matter what threats are given. It’s worth noting that Lamar’s lines are similar to the famed last words of civil rights activist Huey Newton:\n\nYou can kill my body, but you can’t kill my soul. My soul will live forever!\n\nThis could also be interpreted as a statement on martyrdom in general given the heavy Christian themes of the album. There are countless examples throughout history of the inverse Jay-Z—respecting the one who got shot over the shooter.",
            "verified": false,
            "votes_total": 858,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "And I been hustlin' all day, this-a-way, that-a-way\nThrough canals and alleyways, just to say",
        "range": {
          "start": 6,
          "end": 7
        },
        "annotations": [
          {
            "text": "Kendrick and his crew have been striving to get money from sun-up-to-sun-down in the poverty-stricken community that is Compton, California. These simple lines help to emphasize the rat race of daily life taking the listener into the geographic recesses of the underworld.\n\nHis delivery of “this-a-way, that-a-way” is similar to that of Mac Shawn on the chorus of E-40’s March 1995 track, “Sideaways.” Kendrick references E-40 in the second verse.",
            "verified": false,
            "votes_total": 114,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "Money trees is the perfect place for shade\nAnd that's just how I feel, nah, nah",
        "range": {
          "start": 8,
          "end": 9
        },
        "annotations": [
          {
            "text": "Having a lot of money is the most comfortable place to be. Kendrick is trying to suggest that although he feels passionately about the above statements, having a large amount of money shades him from facing hardships that many people encounter today.\n\n\n\nYou have two options: pursue money or pursue meaning. Both can get you rich if you hustle hard enough. However, the pursuit of purely money is just a temporary place for security. This also implies that money and wealth is extremely susceptible to evil (might make you do some shady things).\n\nLater in the album, Kendrick tells us that they are ‘dying of thirst’. Literally speaking, shade can serve to temporally subdue their need to be saved, but does not fix the problem.",
            "verified": false,
            "votes_total": 364,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "A dollar might just fuck your main bitch\nThat's just how I feel, nah\nA dollar might say fuck them niggas that you came with\nThat's just how I feel, nah, nah\nA dollar might just make that lane switch\nThat's just how I feel, nah\nA dollar might turn to a million and we all rich\nThat's just how I feel",
        "range": {
          "start": 10,
          "end": 17
        },
        "annotations": [
          {
            "text": "Some people’s desire for money will, ironically, leave them exhausted, disillusioned, or alone—not to mention broke. Others may wander from their faith or loyalty. This notion coincides with the “Halle Berry” or “Hallelujah” theme found earlier in the chorus.\n\nThe closing lines, however, evoke winning the lottery; where the purchase of an inexpensive ticket can result in millions of dollars. This blurs the lines between the misconception that “money is the root of all evil” and its ability to change lives. In actuality, it is the love of money that is considered to be evil, according to 1 Timothy 6:10:\n\nFor the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\n\n\n\nThese bars might also allude to Dolemite, an April 1975 blaxploitation film about a rebellious pimp.",
            "verified": false,
            "votes_total": 340,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Bridge",
    "lines": [
      {
        "id": 1,
        "text": "Be the last one out to get this dough? No way\nBe the last one out to get this dough? No way",
        "range": {
          "start": 1,
          "end": 5
        },
        "annotations": [
          {
            "text": "The early bird gets the worm, whether you’re in the hood or a high-rise. Fitting with the theme of the song, this bridge (sung by Anna Wise) touches on all the ways NOT to get money–i.e. snoozing, losing, quitting or breaking the code implemented by the likes of Tupac and his contemporaries.",
            "verified": false,
            "votes_total": 121,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Love one of you bucket-headed hoes? No way\nLove one of you bucket-headed hoes? No way",
        "range": {
          "start": 2,
          "end": 6
        },
        "annotations": [
          {
            "text": "With a bucket on your head, your vision becomes rather limited – and you probably don’t have a good sense of direction.\n\nOn the contrary, escaping the hood and achieving bigger dreams was a major priority of Kendrick’s. With his direction in mind, young K Dot avoided interaction with women that had near-sighted ideas of their future, and could distract him from seeing his goals.\n\n‘Bucket-headed’ is also likely an alternative to saying “chickenhead,” which refers to a promiscuous woman. He’s got no love for them. Buckets are hollow, so females with “bucket heads” don’t have much going on in their noggins either.\n\nAs Dr. Dre would say,\n\nYou can’t make a ho a housewife",
            "verified": false,
            "votes_total": 195,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "Hit the streets, then we break the code? No way\nHit the streets, then we break the code? No way",
        "range": {
          "start": 3,
          "end": 7
        },
        "annotations": [
          {
            "text": "The G-code is a term which refers to the systematic dissuasion of snitching. The phrase, initiated by propaganda in Baltimore, MD, was intended to prevent members of inner-city communities from ratting each other out to the authorities.\n\n\n\nTupac was the poster-boy for the code of T.H.U.G.L.I.F.E. as hip hop was reaching new heights in the 90s. It was coordinated by and implemented with the help of his stepfather, Mutulu Shakur.\n\n\n\nTupac had “THUG LIFE” tatted on his chest… sort of.",
            "verified": false,
            "votes_total": 138,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "Hit the brakes when they on patrol? No way",
        "range": {
          "start": 4,
          "end": 4
        },
        "annotations": [
          {
            "text": "There’s a myth that if you’re speeding past a cop and tap your brakes at the last second then they are more likely to pull you over. The brake lights draw more attention and prove that you know what you were doing is wrong. The characters in the story are going to keep hustling regardless of what the cops think. They’re not slowing down for anyone.",
            "verified": false,
            "votes_total": 11,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "Hit the brakes when they on patrol? No way",
        "range": {
          "start": 8,
          "end": 8
        },
        "annotations": [
          {
            "text": "There’s a myth that if you’re speeding past a cop and tap your brakes at the last second then they are more likely to pull you over. The brake lights draw more attention and prove that you know what you were doing is wrong. The characters in the story are going to keep hustling regardless of what the cops think. They’re not slowing down for anyone. “nichochill69”",
            "verified": false,
            "votes_total": 4,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 3",
    "lines": [
      {
        "id": 1,
        "text": "'Magine Rock up in them projects where them niggas pick your pockets",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "Moving out the projects was hard. That’s home. I still got family there and sometimes it feels good to come back. A lot of people that grew up in certain neighborhoods don’t get to come back. But even though I have good days and bad days in the projects, it taught me how to be strong and be a man. It’s gutter, that is all I can say.\n\nAny real street person will tell you, get money and move out when you are successful. See different things. Then come back and talk to the young cats and show them the way. The projects are always going to be here. But sometimes it’s good to see other people going through the same thing or even worse struggles than you.",
            "verified": true,
            "votes_total": 559,
            "pinnedRole": "Featured Artist"
          },
          {
            "text": "He’s setting the image for this verse, him in front of the Nickerson Gardens Projects in Watts, Los Angeles, where statistically there are roughly 5 reported thefts a day.\n\nThe double entendre: Jay Rock is found in the projects as are (crack) rocks.",
            "verified": false,
            "votes_total": 124,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Santa Claus don't miss them stockings,",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "Noted in his Decoded video two lines above, Jay Rock states this line means:\n\nthey goin in your socks, nahmean\"\n\n\n\nWhich if you don’t know, means when you get mugged/robbed whomever is robbing you is checking every little place you could hide your loot, including your socks. Drug dealers are also known to keep their stash in their socks as well. It should also be noted that Jay Rock and friends are known to be Bloods who would wear the color red a lot, just like Santa Claus.",
            "verified": false,
            "votes_total": 138,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "liquors spillin', pistols poppin'",
        "range": {
          "start": 3,
          "end": 3
        },
        "annotations": [
          {
            "text": "The effect and cause of being in the m.A.A.d city: Liquor spilling is commonly known as a sign of respect for the dead. Dump out your homie’s favorite 40 oz to honor their memory.\n\n\n\nPistols popping will have your dumping your liquor out sooner or later. “Liquor spilling” could also be interpreted in the sense of bottles being dropped during the fray of a drive-by shooting or being run up on. As was the case in Kendrick’s “Ignorance is Bliss” video:\nhttp://youtu.be/00cr3g6wCG0?t=1m22s",
            "verified": false,
            "votes_total": 66,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "Bakin' soda, yola whippin', ain't no turkey on Thanksgivin'",
        "range": {
          "start": 4,
          "end": 4
        },
        "annotations": [
          {
            "text": "YOLA whipping refers to using baking soda to cook down cocaine into crack. That’s the only cooking going on in his kitchen – there’s no turkey being made on Thanksgiving like there would be in most, more-fortunate homes.\n\nJay Rock also has a track called “YOLA.”\n\nhttp://www.youtube.com/watch?v=qnztMFetHAY",
            "verified": false,
            "votes_total": 122,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "My homeboy just domed a nigga, I just hope the Lord forgive him",
        "range": {
          "start": 5,
          "end": 5
        },
        "annotations": [
          {
            "text": "Jay Rock saying his friend just shot someone in the head is ironic, especially considering Kendrick’s Verse 2 description of his uncle being murdered in the same way. There’s a passing desire for God’s forgiveness, but Jay Rock delivers the line casually, like it’s just something you say. It’s all part of the lifestyle. Then the very next line discusses cocaine residue and going back to hustlin'. Their existence is more focused on survival than being right with God. Such is the effect of focusing on money, whether it’s because of necessity or greed.",
            "verified": false,
            "votes_total": 26,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "Pots with cocaine residue, every day, I'm hustlin",
        "range": {
          "start": 6,
          "end": 6
        },
        "annotations": [
          {
            "text": "Pots in or around jay rock’s presence contain “cocaine residue” due to him being done whipping it up. “Every day, I’m hustlin” he’s out putting in work aka “hustlin” selling rocks",
            "verified": false,
            "votes_total": 0,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 7,
        "text": "What else is a thug to do when you eatin' cheese from the government?",
        "range": {
          "start": 7,
          "end": 7
        },
        "annotations": [
          {
            "text": "Paying with government-sponsored food stamps, is eating (with) government money.\n\n\n\nHe may be alternatively referring to literally eating government cheese which used to be issued to people on welfare. A lot of the times, legit businesses do not give “thugs” a chance at a job, so most of the time they resort to selling drugs in order to make ends meet, since welfare isn’t enough.\n\nReferences to money growing on trees and government cheese were both used in the opening sequence for Friday:\n\nhttp://youtu.be/TOryVF_iM9Q?t=1m29s\n\nIt could also be a double entendre since “cheese” is slang for money. So it’s like how cheese represents food being issued by the government, or it could also be discussing welfare. The welfare one could also connect to the line about pick-pockets since they are related through the idea of money.\n\nHence “Cheese” is slang for money, maybe he literally meant that he got money from flipping his cocaine from the United States Government.",
            "verified": false,
            "votes_total": 115,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 8,
        "text": "Gotta provide for my daughter 'nem, get the fuck up out my way, bish",
        "range": {
          "start": 8,
          "end": 8
        },
        "annotations": [
          {
            "text": "Jay Rock is emphasizing how the everyday struggle to simply provide food for a family can turn a person against the world and become cold-hearted.\nThis line also piggybacks off the overall idea of survival becoming a priority in an unforgiving environment/position.",
            "verified": false,
            "votes_total": 8,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 9,
        "text": "Got that drum and I got them bands just like a parade, bish",
        "range": {
          "start": 9,
          "end": 9
        },
        "annotations": [
          {
            "text": "Firearms are sometimes equipped with drums that hold more ammo than regular magazines. Bands refers to the rubber bands that wrap around Jay’s huge amounts of cash.\n\n\n\nA simile is used here, as parades usually have marching bands participating and those bands have drums (snare, bass, toms).",
            "verified": false,
            "votes_total": 98,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 10,
        "text": "Drop that work up in the bushes, hope them boys don't see my stash\nIf they do, tell the truth, this the last time you might see my ass",
        "range": {
          "start": 10,
          "end": 11
        },
        "annotations": [
          {
            "text": "If you’ve ever watched the show Cops, then you know what he’s talking about. While Jay is running from the police he tosses his enormous stash of drugs in the bushes. If the police find it, he’ll be getting locked up for a really long time.",
            "verified": false,
            "votes_total": 133,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 11,
        "text": "From the gardens where the grass ain't cut,",
        "range": {
          "start": 12,
          "end": 12
        },
        "annotations": [
          {
            "text": "Jay Rock is from the infamous Nickerson Gardens section 8 projects in Watts, California. He plays off the name of his project housing (“gardens”) but unlike most gardens, his was unkempt.\n\n\n\nThis is also a play on the phrase “my ass is grass.” That term is used when a person gets in trouble. If the feds pick up his cocaine from the bushes, his ass will definitely be in trouble.",
            "verified": false,
            "votes_total": 66,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 12,
        "text": "them serpents lurkin', blood\nBitches sellin' pussy, niggas sellin' drugs, but it's all good",
        "range": {
          "start": 13,
          "end": 14
        },
        "annotations": [
          {
            "text": "In the Nickerson Gardens Projects, which is one of the biggest section 8 housing systems in America, the concentration of people are thugs, prostitutes, and drug dealers. This life was forced on them by our government. By saying “but it’s all good,” Jay portrays the idea that he has grown accustomed to these people being from the same neighborhood.\n\nSerpents represent those who will “snake” on you. If you don’t keep those whom you roll with in check/ keep your circle small (grass cut), there are bound to be snakes lurking. One of the gangs that originated in the Nickerson Gardens was the Bounty Hunter BLOODS.\n\nThem serpents lurking could be a play on words referring to the garden of Eden and the story of Adam and Eve in the book of Genesis; implying that serpents are also in his place tempting people.",
            "verified": false,
            "votes_total": 114,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 13,
        "text": "Broken promises, steal your watch and tell you what time it is",
        "range": {
          "start": 15,
          "end": 15
        },
        "annotations": [
          {
            "text": "Double meaning here: While literally stealing someone else’s watch will give you the power to tell them what the time is, the actual act of theft is also letting your victim know that this is what’s going down, and they can’t do anything about it. You can also mark the passage of time with these broken promises.\n\nAlso, the scenario described here is adding “insult to injury” – Jay Rock fully underlines the unrepentant harshness of the ghetto life.\n\nNevertheless, Jay Rock still might be talking about the “snakes” – the people you can’t trust, the backstabbers, the ones that break promises; the same people that are helping you are hurting you. He is letting you know the time but is using your watch, just like the snake in the grass, or the snake that lurks in the flowers, its tempting and promising to go out and pick a flower, but once you do (trust those snakes) they will bite you (steal your watch, J’s, break the promise, backstab you)",
            "verified": false,
            "votes_total": 155,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 14,
        "text": "Take your J's and tell you to kick it where a Foot Locker is",
        "range": {
          "start": 16,
          "end": 16
        },
        "annotations": [
          {
            "text": "Jay Rock proclaims that after he takes your Js (Jordans a popular shoe brand) he’ll tell you go to a Foot Locker which is a shoe store. Jay Rock uses kick as a double entender for telling you to go somewhere but also to kick something you usually have shoes on making fun of the fact that the person no longer has their shoes.\n\n\nImage above shows what a Foot Locker looks like where his opponent would need to find a new pair of Jordans after he has been robbed from Jay Rocks.\n\n\nImage above shows a Jordan a shoe brand that was especially popular in the 90s and still is popular to this day. They are named after the popular basketball star Michael Jordan but abbreviated by Nike to just Jordans or Js as Jay Rocks uses here.",
            "verified": false,
            "votes_total": 1,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 15,
        "text": "In the streets with a heater under my dungarees",
        "range": {
          "start": 17,
          "end": 17
        },
        "annotations": [
          {
            "text": "Dungaree is generally the heavy cloth used to make jeans (and so can refer to jeans in general).\n\nHowever in popular usage the term refers specifically to jean overalls. Dungaree overalls were popularized in the 1990s by a variety of rappers, most notably 2Pac – for instance Biggie referred to dungarees in order to throw a subliminal shot at Pac\n\nHeater of course refers to a gun Jay is keeping on his person, to protect himself from the aforementioned dangers of the hood.",
            "verified": false,
            "votes_total": 89,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 16,
        "text": "Dreams of me gettin' shaded under a money tree",
        "range": {
          "start": 18,
          "end": 18
        },
        "annotations": [
          {
            "text": "Jay Rock juxtaposes the realities of life against his unattainable dreams.\n\nHe’s at a crossroads in his life: In order to fulfill his dream of living well under a “money tree”, he must perform unsavory acts as alluded by him carrying around a gun. Does one compromise one’s own ethics and morals in order to achieve one’s dream? This is what Jay Rock contemplates this whole verse.\n\nThere’s also a subtle juxtaposition of the heater against the coolness of shade.\n\nAlso Jay Rock’s word choice of “shaded” could be interpreted as an allegory for death (i.e. the brightness of life in contrast with the darkness of death). Him carrying a gun also reiterates the same tone of the hook that follows; the gun gives him power to achieve his monetary dreams but it could potentially also be the death of him as a result.",
            "verified": false,
            "votes_total": 256,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "It go Halle Berry or hallelujah",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "https://soundcloud.com/rapgenius/kendrick-on-it-go-halle-berry\nYou can either go right, or you can go left and get crazy with us. Basically just saying we throw the evils of the world in the air. Now, K. Dot, you can either get with the program or you don’t have to, it’s whatever. Of course, hallelujah being the more good in me and Halle Berry being the actual vice of what’s going down – the lust for the money, the lust for this mission we are about to go on. Pick your poison, tell me what you’re doing. But when you tell me, tell me right now. We ain’t got time to wait.",
            "verified": true,
            "votes_total": 1731,
            "pinnedRole": "Artist"
          },
          {
            "text": "Kendrick is questioning whether his listeners pick worldly pleasures or a principled, religious life. Southern artist Big KRIT portrayed this very dilemma with the artwork of his March 2012 mixtape 4Eva N A Day.\n\nThis could also be a metaphor for our civilization’s future rather than just an individual. Will we carry on with a Hollywood-centered mindset or an enlightened one? Will we worship celebrities or God?\n\nThis concept goes all the way back to St. Augustine. In his 5th century philosophical piece, The City of God, he portrays all of human history and civilization as a conflict between the ‘City of Man’ and the ‘City of God.’ It was written shortly after Rome was sacked by Visigoths, but Augustine counsels the faithful not to worry about the fate of the material world, but rather, to be concerned with the heavenly world—the New Jerusalem.",
            "verified": false,
            "votes_total": 450,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Pick your poison, tell me what you doin'",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "Halle Berry is an Oscar-winning actor, but she’s also a veritable sex symbol. Kendrick equates her name with worldly pleasure, contrasting it with the similar-sounding biblical phrase, “Hallelujah,” meaning “praise the Lord” in Hebrew.\n\nWhether it’s pussy or religion, Kendrick illustrates that dedicating one’s life to either can lead to suffering. This is a direct symbol for the “poison” Kendrick had to endure by making the choice to follow salvation in the midst of the darkness that defines Compton.",
            "verified": false,
            "votes_total": 231,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "Everybody gon' respect the shooter\nBut the one in front of the gun lives forever\n(The one in front of the gun, forever)",
        "range": {
          "start": 3,
          "end": 5
        },
        "annotations": [
          {
            "text": "Although the shooter may get temporary attention from committing the murder, it’s the victim who is remembered and honored forever. Kendrick’s friend Dave dies in a shootout in the outro of “Swimming Pools (Drank)” and is immortalized in the first verse from “Sing About Me, I’m Dying of Thirst.” These lyrics are reflective of Lamar’s reality, who expanded on the lines in a 2012 interview with The Guardian:\n\nYou don’t hear no artists from Compton showing vulnerability. You always hear about the person pulling the trigger. You never hear about the one in front of it. That’s the most interesting story to me.\n\nKendrick might have been inspired by Nas when writing these lines, as Nas similarly covered this same idea in 1994’s “One Love” off Illmatic:\n\n‘Cause when the pistol blows\nThe one that’s murdered be the cool one\n\nThis can also be seen as an analogy to suggest that a controlling regime (the shooter) gets respect (obedience), but “the one in front of the gun” (the people) will always exist, no matter what threats are given. It’s worth noting that Lamar’s lines are similar to the famed last words of civil rights activist Huey Newton:\n\nYou can kill my body, but you can’t kill my soul. My soul will live forever!\n\nThis could also be interpreted as a statement on martyrdom in general given the heavy Christian themes of the album. There are countless examples throughout history of the inverse Jay-Z—respecting the one who got shot over the shooter.",
            "verified": false,
            "votes_total": 858,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "And I been hustlin' all day, this-a-way, that-a-way\nThrough canals and alleyways, just to say",
        "range": {
          "start": 6,
          "end": 7
        },
        "annotations": [
          {
            "text": "Kendrick and his crew have been striving to get money from sun-up-to-sun-down in the poverty-stricken community that is Compton, California. These simple lines help to emphasize the rat race of daily life taking the listener into the geographic recesses of the underworld.\n\nHis delivery of “this-a-way, that-a-way” is similar to that of Mac Shawn on the chorus of E-40’s March 1995 track, “Sideaways.” Kendrick references E-40 in the second verse.",
            "verified": false,
            "votes_total": 114,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "Money trees is the perfect place for shade\nAnd that's just how I feel",
        "range": {
          "start": 8,
          "end": 9
        },
        "annotations": [
          {
            "text": "Having a lot of money is the most comfortable place to be. Kendrick is trying to suggest that although he feels passionately about the above statements, having a large amount of money shades him from facing hardships that many people encounter today.\n\n\n\nYou have two options: pursue money or pursue meaning. Both can get you rich if you hustle hard enough. However, the pursuit of purely money is just a temporary place for security. This also implies that money and wealth is extremely susceptible to evil (might make you do some shady things).\n\nLater in the album, Kendrick tells us that they are ‘dying of thirst’. Literally speaking, shade can serve to temporally subdue their need to be saved, but does not fix the problem.",
            "verified": false,
            "votes_total": 364,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Skit",
    "lines": [
      {
        "id": 1,
        "text": "Kendrick, just bring my car back, man, I, I called in for another appointment\nI figured you weren't gonna be back here on time anyway, look\nShit, shit, I just wanna get out the house, man\nThis man is on one, he feelin' good than a motherfucker\nShit, I'm tryna get my thing goin' too (Girl, I want your body)\nI'm going over to Merlin house, just bring my car back (I want your body)\nShit, he faded, he feelin' good, look, listen to him\n'Cause you got a big ol' fat assGirl, girl, I want your bodyI want your body, 'cause of that big ol' fat ass, girl\nSee, he high as hell (I want your body, 'cause of that big ol'—)\nShit, he ain't even trippin' off them dominoes no more, just bring the car back\nDid somebody say dominoes?",
        "range": {
          "start": 1,
          "end": 11
        },
        "annotations": [
          {
            "text": "This is a skit where K.Dot’s mother leaves another voice-mail. She wants her car back. In the background, Kendrick’s dad can be heard. Now that he’s in his groove (seemingly drunk/high), he playfully sings about his desire to handle the “assets” of Kendrick’s mom. This helps transition to the soothing and sexual vibe given off on the next track, “Poetic Justice”.\n\nAs is to be expected of an album that’s all about the narrative, the story of Kendrick’s parents mirror the overall tone of the album at any given time.\n\nHere, as the album continues its descent into despair, we see the same thing shown by Kendrick’s parents — his father’s already drunk/high, and his mother has gone from wanting the van to go to the County building and get food stamps for the family so they can eat (as shown at the end of “Sherane”) to figuring that Kendrick won’t be back in time so she may as well “get her thing going” (go get drunk too). The priorities of the characters shift with the tone as it gets darker and darker.\n\nThe tune Kendrick’s dad sings is also seen in the video for “Backseat Freestyle”.\n\nNote again that Kendrick’s dad wants his dominoes. Dominoes is slang for Amphetamines. Kendrick’s mom wants him to come back so he can help her deal with her drug-addicted husband.",
            "verified": false,
            "votes_total": 464,
            "pinnedRole": null
          }
        ]
      }
    ]
  }
]