[
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "Mass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby",
        "range": {
          "start": 1,
          "end": 4
        },
        "annotations": [
          {
            "text": "Affected by bad influences, the youth cyclically misjudge situations as if they’re hallucinating. The song should help with getting on the right path, as Kendrick’s confession of being a good kid dealing with gangs, police brutality, and drugs should serve as an example.\n\nThe last two lines are likely a reference to the song “We live in Brooklyn Baby” by Roy Ayers Ubiquity, from their 1972 album, He’s Coming.",
            "verified": false,
            "votes_total": 307,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 1",
    "lines": [
      {
        "id": 1,
        "text": "Look inside these walls and you see I'm havin' withdrawals\nOf a prisoner on his way\nTrapped inside your desire to fire bullets that stray\nTrack attire just tell you I'm tired and ran away",
        "range": {
          "start": 1,
          "end": 4
        },
        "annotations": [
          {
            "text": "Withdrawals are the negative physical or psychological effects of ceasing a drug habit.\n\nIf the listener could see inside Kendrick’s mind—the facades people put up to hide their true selves are often called “walls”—one would see that his mind is trying to escape this dangerous environment. While trying to cleanse himself of these influences, they are constantly trying to reenter. He’s also literally trapped inside the “walls” of a city plagued by gang violence, and he’s recognizing that his actions and the actions of those around him will inevitably lead to a life toiling in Compton.",
            "verified": false,
            "votes_total": 115,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "I should ask a choir: \"What do you require\nTo sing a song that acquire me to have faith?\"\nAs the record spin I should pray",
        "range": {
          "start": 5,
          "end": 7
        },
        "annotations": [
          {
            "text": "Kendrick, amidst all the sinful actions in his environment, is feeling his least religious; it’s difficult to have faith in such hopeless conditions.\n\nAnd so since choirs and churches are non-influential in his everyday decisions, he resorts to putting on a hip-hop record. His lifestyle is in accordance to what the hip-hop songs are saying, so in essence, hip-hop is his religion.\n\nA slight nod to “Can’t Knock The Hustle”",
            "verified": false,
            "votes_total": 92,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "For the record, I recognize that I'm easily prey",
        "range": {
          "start": 8,
          "end": 8
        },
        "annotations": [
          {
            "text": "Kendrick realizes because of his non-gang affiliation and small stature that he’s an easy target.",
            "verified": false,
            "votes_total": 51,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "I got ate alive yesterday",
        "range": {
          "start": 9,
          "end": 9
        },
        "annotations": [
          {
            "text": "A subtle way to say that he is in the belly of the beast, which generally means being in the middle of a very bad situation or a dangerous place, like a m.A.A.d city of some sort.\n\nA child growing up in a violent environment where he is targeted by the authorities and the outlaws feels like fishing in a barrel, which means extremely easy, or not difficult at all. This is a fun expression that creates a whimsical mental picture. Imagine how hard it would be to shoot a fish in the river or in the ocean. Now, imagine how much easier it would be if the fish were stuck in a barrel… or a m.A.A.d city of some kind…\n\nThis line is saying he went through a very difficult experience yesterday, but considered in context of the album’s narrative, it implies the two men in black hoodies jumped him after the skit at the end of the previous track.\n\nThe fact he uses “ate” instead of “eaten” may also be a subtle allusion to his previous record, section.80, which is partly a reference to Section 8 housing), also known as low-income housing. This nod to the impoverished conditions around him helps explain why Kendrick’s is experiencing difficulty despite being a good kid.",
            "verified": false,
            "votes_total": 20,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "I got animosity buildin', it's prob'ly big as a buildin'",
        "range": {
          "start": 10,
          "end": 10
        },
        "annotations": [
          {
            "text": "This might be an unintentional reference to Big Pun’s bar on Twinz (Deep Cover ‘98). https://genius.com/11753",
            "verified": false,
            "votes_total": 1,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "Me jumpin' off of the roof is me just playin' it safe",
        "range": {
          "start": 11,
          "end": 11
        },
        "annotations": [
          {
            "text": "Here, Kendrick is talking about how doing something considered extremely dangerous for others is him playing it safe.\n\nDue to him being treated as prey and “eaten alive”, animosity builds inside of him until it reaches the size of a large building. Him “jumpin' off of the roof” implies that he left his animosity towards others behind and rejects the negative mindset of those around him. He goes on to assure us on a later verse that by rejecting the negativity surrounding him, the people that treated him like prey would come to respect him.",
            "verified": false,
            "votes_total": 11,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 7,
        "text": "But what am I 'posed to do when the topic is red or blue\nAnd you understand that I ain't\nBut know I'm accustomed to just a couple that look for trouble\nAnd live in the street with rank",
        "range": {
          "start": 12,
          "end": 15
        },
        "annotations": [
          {
            "text": "In Compton’s gang rivalry, the color red represents the Bloods while the color blue represents the Crips. Though he hung out around those who were apart of these gangs, Kendrick himself was never affiliated with either side. He was just the good kid in the middle.\n\nThis caused many of his affiliated friends to question him on which side he was on. It also caused him to get jumped by gang members of both sides since since he was associated with friends of both sides;  In “P&P 1.5”, Kendrick rapped\n\nGuilty by association: story of my life, nigga",
            "verified": false,
            "votes_total": 158,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 8,
        "text": "Step on my neck and get blood on your Nike checks",
        "range": {
          "start": 16,
          "end": 16
        },
        "annotations": [
          {
            "text": "Kendrick challenges his gang rivals to jump him. “Nike Check” refers to the signature Nike “Swoosh” logo. “Checks” are also a shoe series made by Nike:",
            "verified": false,
            "votes_total": 147,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 9,
        "text": "I don't mind 'cause one day you'll respect\nThe good kid, m.A.A.d city",
        "range": {
          "start": 17,
          "end": 18
        },
        "annotations": [
          {
            "text": "Kendrick takes solace in the fact that one day the same gang members that harassed him will respect him for what he’s done outside of the streets of Compton. “‘Cause” is also common Crip slang. In the previous line, he mentions Bloods—i.e. the opposite side. They’ll both respect him when he’s made it.\n\nLamar told Complex in October 2012:\n\nThat represents the space I was in. Knowing that you’re doing wrong things, but at the same time, you’re a good kid at heart. I knew what I was doing and what I was getting myself into and the people I’m hanging with.",
            "verified": false,
            "votes_total": 262,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "Mass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby",
        "range": {
          "start": 1,
          "end": 4
        },
        "annotations": [
          {
            "text": "Affected by bad influences, the youth cyclically misjudge situations as if they’re hallucinating. The song should help with getting on the right path, as Kendrick’s confession of being a good kid dealing with gangs, police brutality, and drugs should serve as an example.\n\nThe last two lines are likely a reference to the song “We live in Brooklyn Baby” by Roy Ayers Ubiquity, from their 1972 album, He’s Coming.",
            "verified": false,
            "votes_total": 307,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 2",
    "lines": [
      {
        "id": 1,
        "text": "All I see is strobe lights, blindin' me in my hindsight",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "After he got jumped or whatever might’ve happened, the cops came (strobe lights).\n\n\n\n“Blinding me in my hindsight” refers to him not telling the cops anything (being blind). Generally the cops will ask you to recount what happened. Wordplay: – to be “in hindsight”, is understanding an event after it had transpired, so looking back and observing a specific moment.\n\nThe lights of the police car are actually blinding him from seeing what happened to him.",
            "verified": false,
            "votes_total": 93,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "In all honesty I got time to be copacetic until\nYou had finally made decision to hold me against my will",
        "range": {
          "start": 2,
          "end": 3
        },
        "annotations": [
          {
            "text": "“Copacetic” means “OK” or “Satisfactory.” His choice of words here is a play on the word “cop” as in “police officer”.\n\nSo everything was cool between Kendrick and the cops until they decide to cuff him even though he did nothing wrong.",
            "verified": false,
            "votes_total": 111,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "It was like a head-on collision that folded me standing still",
        "range": {
          "start": 4,
          "end": 4
        },
        "annotations": [
          {
            "text": "Cops sudden decision to  harass Kendrick felt as damaging as a head-on on collision would be. Him being in a head-on collision is also a metaphor for gangs and police, and Kendrick being the good, innocent kid who suffers the cause of an on-going battle, which is fueled by racial profiling. Cops completely ignore Kendrick’s good intentions to progress into a better version of himself, but quickly rush into violence and racial profiling, leaving Kendrick puzzled on what he can do to stop this. All those factors led to Kendrick not being able to tell the difference between crooked and a good police officer.",
            "verified": false,
            "votes_total": 70,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "and your dog has to say woof",
        "range": {
          "start": 5,
          "end": 5
        },
        "annotations": [
          {
            "text": "Police dogs are trained to bark at a person when they smell drugs on them.\n\n\n\nKendrick is also mocking the stereotypes society has put in place like “cops are good” or “blacks have to be criminals”, he shows this through the expected actions of a dog.\n\nIt’s also a play of words, as a K9 barks to alert something is wrong and they are a dog, “your dog”. Sometimes people refer to their friends as their dog, so this could mean Kendrick’s friend has to alert him that police are around.",
            "verified": false,
            "votes_total": 62,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 5,
        "text": "And you ask: \"Lift up your shirt,\" because you wonder if a tattoo\nOf affiliation can make it a pleasure to put me through",
        "range": {
          "start": 6,
          "end": 7
        },
        "annotations": [
          {
            "text": "It’s not uncommon for people involved in illegal gang activity to bear tattoos in common with other gang members. While there are obvious issues with this kind of behaviour, there are also corrupt officials which will go out of their way to identify supposed gang members and brutalize them based on suspicion alone.\n\nKendrick has been conditioned to expect this kind of prejudice based on his ethnicity alone, as have many Black Americans in their encounters with the police.",
            "verified": false,
            "votes_total": 5,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 6,
        "text": "I heard 'em chatter: \"He's prob'ly young, but I know that he's down\nStep on his neck as hard as your bullet-proof vest",
        "range": {
          "start": 8,
          "end": 9
        },
        "annotations": [
          {
            "text": "The police disregard his young age and assume that he’s “down” (gang affiliated), probably just because he’s black. They rough him up based on this assumption, in exactly the same way as the gang members in the first verse.\n\nhttp://www.youtube.com/watch?v=nSLLGgSPRVo\n\nThe fact that they would assume that even a minor is involved in gang warfare also indirectly draws attention to how young most people are when they get into this kind of thing. Being 16 doesn’t indicate at all that he’s too young to be a gang banger.\n\nKendrick uses a simile, comparing a bullet proof vest, which needs to be strong enough to withstand the impact of bullets, to how hard the police officer is stepping on his neck, illustrating the brutal violence the police in Compton use. It also highlights the difference in power between the authority like them and a kid like himself since he’s just walking unprotected and unarmed (“easily prey”) while they have things like attack dogs and bulletproof vests.\n\nThe line of them saying, “He’s probably young but I know that he’s down,” shows the craziness of the cops. You can KNOW when a guy is young, but not know that he’s in a gang. However here, it’s the opposite; they assume with certainty that he’s in a gang without even taking any time to figure out his age.",
            "verified": false,
            "votes_total": 163,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 7,
        "text": "He don't mind, he know we'll never respect\nThe good kid, m.A.A.d. city.\"",
        "range": {
          "start": 10,
          "end": 11
        },
        "annotations": [
          {
            "text": "The police will never respect the good kids in Compton trying to find their way out, because for them everybody in Compton must be affiliated to a gang.\n\nAt least the gang members in the first verse might end up respecting Kendrick after he proves himself, but the police will always see him as a black thug.",
            "verified": false,
            "votes_total": 294,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "Mass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby",
        "range": {
          "start": 1,
          "end": 4
        },
        "annotations": [
          {
            "text": "Affected by bad influences, the youth cyclically misjudge situations as if they’re hallucinating. The song should help with getting on the right path, as Kendrick’s confession of being a good kid dealing with gangs, police brutality, and drugs should serve as an example.\n\nThe last two lines are likely a reference to the song “We live in Brooklyn Baby” by Roy Ayers Ubiquity, from their 1972 album, He’s Coming.",
            "verified": false,
            "votes_total": 307,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 3",
    "lines": [
      {
        "id": 1,
        "text": "All I see in this room: 20's, Xannies and these 'shrooms",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "He is in another “room” surrounded by twenty dollars worth of marijuana, Xanax, (xanies, anxiolytic, specifically, it’s a benzo), and psilocybin “magic” mushrooms.\n\nXanax and mushrooms are significant as Xanax is used, (at least clinically), for anti-anxiety, and mushrooms create an illusion, or alternate reality. Kendrick is describing his attempt to escape the stressors of his society.",
            "verified": false,
            "votes_total": 79,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "Grown-up candy for pain, can we live in a sane",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "Candy is to kids as drugs are to adults. Candy makes children comfortable and happy, therefore, for many adults, drugs are candy.\n\nXanax provides anti-anxiety and mushrooms create an illusion, or alternate reality to escape the pain.",
            "verified": false,
            "votes_total": 65,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "You hired me as a victim,",
        "range": {
          "start": 3,
          "end": 3
        },
        "annotations": [
          {
            "text": "This is alluding to the government’s intrusive way of dealing with the people on this planet. We are not just born into this world, we are hired as a victim.\n\nThis may also be referring to his recent popularity as a rapper. Many people like his music because of the fact he is a “victim” of the government, gangs, etc. Thus he is “hired” as a victim.",
            "verified": false,
            "votes_total": 71,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 4,
        "text": "Don't mind, 'cause now you ever in debt to good kid, m.A.A.d. city",
        "range": {
          "start": 4,
          "end": 4
        },
        "annotations": [
          {
            "text": "Kendrick remarks in “The Art of Peer Pressure” about how he’s a strong believer in karma. Compton will forever owe Kendrick the debt of his childhood. Compton can not turn back time and make right what it has collectively wronged. Kendrick is reimbursed for K-Dot’s struggle through his career as a storyteller.\n\nKendrick is Compton’s “human sacrifice”. And so when Kendrick is finally redeemed for all he had to endure from his environment, all the players will be indebted to him for his sacrifice. They’ll owe him his respect for this.",
            "verified": false,
            "votes_total": 217,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "Mass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby",
        "range": {
          "start": 1,
          "end": 4
        },
        "annotations": [
          {
            "text": "Affected by bad influences, the youth cyclically misjudge situations as if they’re hallucinating. The song should help with getting on the right path, as Kendrick’s confession of being a good kid dealing with gangs, police brutality, and drugs should serve as an example.\n\nThe last two lines are likely a reference to the song “We live in Brooklyn Baby” by Roy Ayers Ubiquity, from their 1972 album, He’s Coming.",
            "verified": false,
            "votes_total": 307,
            "pinnedRole": null
          }
        ]
      }
    ]
  }
]