[
  {
    "type": "Verse 1",
    "lines": [
      {
        "id": 1,
        "text": "You don't ever have to be stronger than you really are\nWhen you're lying in my arms, baby",
        "range": {
          "start": 1,
          "end": 2
        },
        "annotations": [
          {
            "text": "On multiple occasions Lana has expressed her submissive roles in past romantic relationships, and has often been criticised for it. This line may show a willingness to change and embrace the vulnerability of the one she loves, rather than being the one that wants security and protection. This is in contrast to her earlier work, displaying her new found responsibility in those she loves.",
            "verified": false,
            "votes_total": 36,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "You don't ever have to go faster than your fastest pace\nOr faster than my fastest cars",
        "range": {
          "start": 3,
          "end": 4
        },
        "annotations": [
          {
            "text": "Lana is well known to be infatuated with cars, especially vintage ones, featuring them on almost every album cover she’s ever shot.\n\nShe owns a collection of some modern, fast sports cars including two Jaguar models – a 2015 F-Type and a 2013 XK Convertible – both of which a fan infamously attempted to steal in 2015.",
            "verified": false,
            "votes_total": 17,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Pre-Chorus",
    "lines": [
      {
        "id": 1,
        "text": "I shouldn't have done it, but I read it in your letter\nYou said to a friend that you wish you were doing better\nI wanted to reach out, but I never said a thing",
        "range": {
          "start": 1,
          "end": 3
        },
        "annotations": [
          {
            "text": "This could refer to the toxic masculinity that she evoked in Mariners Apartment Complex.\nHer significant other was not willing to accept the help of a woman, in order to hide his weakness; which would stereotypically deprive him of his masculinity.\n\nIn this song she may allude to the same behavior from the person she is singing about.\nShe learned that he wasn’t doing well in this letter that’s destined to a friend, maybe a male friend.\nTherefore she was willing to reach out to him to offer him some help but she ended up not doing it maybe because she knew he wouldn’t accept it nor find it right because she’s a woman.",
            "verified": false,
            "votes_total": 3,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "If you come back to America, just hit me up",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "Lana is possibly referring to her ex-boyfriend Barrie-James O'Neill, who is a Scottish singer and songwriter. At the time of their relationship, O'Neill stayed in the U.S. for a few years to work on his projects. After the breakup in 2014, he decided to move back to Ireland, where he still lives today.",
            "verified": false,
            "votes_total": 63,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "'Cause this is crazy love, I'll catch you on the flip side",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "An expression commonly used in the 70s to say ‘See you when you/I get back!’ or ‘See you later!’. It’s also a direct reference to Lana’s 2014 song “Flipside”.\n\n​Maybe on the flipside I could catch you again\n\nAlso, the flip side is a phrase originating from the idea of when a radio dies would play an album through and the only time they would be heard from is when they are flipping the vinyl, “see you on the flip side”.",
            "verified": false,
            "votes_total": 80,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "If you come back to California, you should just hit me up\nWe'll do whatever you want, travel wherever how far\nWe'll hit up all the old places\nWe'll have a party, we'll dance 'til dawn\nI'll pick up all of your Vogues and all of your Rolling Stones\nYour favorite liquor off the top shelf\nI'll throw a party all night long",
        "range": {
          "start": 3,
          "end": 9
        },
        "annotations": [
          {
            "text": "Lana is referencing Joni Mitchell’s 1971 song “California” which is about her spending some time in Europe before coming back home to California:\n\nReading Rolling Stone, reading Vogue\nThey said, “How long can you hang around?”\nI said a week, maybe two\nJust until my skin turns brown\nThen I’m going home to California\nCalifornia, I’m coming home\nOh, will you take me as I am\nStrung out on another man\nCalifornia, I’m coming home\n\nLana’s putting a spin on Joni Mitchell’s story by singing this song from the point-of-view of an old friend or ex-lover who is welcoming the person to California. She’s likely referring to her ex-boyfriend, Scottish singer-songwriter, Barrie-James O'Neill, who contributed to her 2014 album Ultraviolence.\nEarlier in the verse, she promises to meet him in America if he returns from the UK (where O'Neill is located).\n\n“Your favorite liquor off the top shelf” might be a reference to her song “Carmen” from her debut album Born to Die in which she sings:\n\nDarling, darling\nDoesn’t have a problem lying to herself\n‘Cause her liquor’s top shelf",
            "verified": false,
            "votes_total": 64,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 2",
    "lines": [
      {
        "id": 1,
        "text": "You don't ever have to act cooler than you think you should\nYou're brighter than the brightest stars",
        "range": {
          "start": 1,
          "end": 2
        },
        "annotations": [
          {
            "text": "During an interview with Zane Lowe, while she explained the album’s concept, Lana said:\n“It’s kind of about this guy who is such a genius artist but he thinks he’s the shit and he knows it and he like won’t shut up talking about it. So often I ended up with these creative types or whatever, and you know, they just go on and on about themselves, and I’m like, ‘Yeah, yeah’. But there’s a little bit of merit to it also. They are so good”.\n\nIt seems that Lana’s lover thinks he is good enough, not only to be with her but also with his work. On the other hand, Lana knows that even he being and acting like the best, this could be boring sometimes and she can perfectly handle with that. She knows his defects and loves him after all, as she sings on the title track, Norman Fucking Rockwell:\n“Why wait for the best when I could have you?”",
            "verified": false,
            "votes_total": 55,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Pre-Chorus",
    "lines": [
      {
        "id": 1,
        "text": "I've heard the war was over if you really choose",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "A reference to John Lennon’s and Yoko Ono’s billboard campaign across the world that read: “War is Over! (If You Want It)”\n\nhttps://imgs.smoothradio.com/images/28769?crop=16_9&width=660&relax=1&signature=gonNdHBqIPnQ4kuO4wmORpEwdNc=\n\nThe couple are also referenced on Lana’s 2017 album Lust For Life on the track “Tomorrow Never Came”, which features their son Sean Ono Lennon.\n\nLennon and Yoko, we would play all day long\n“Isn’t life crazy?”, I said now that I’m singin' with Sean\n\nLana has used the recurring motif of war throughout her discography to represent difficulties with mental health, with “the war” meaning fighting her battle with depression. This can be seen in “Ride” and “Get Free”:\n\n\nBeen trying hard not to get into trouble, but I\nI’ve got a war in my mind\n\nSometimes it feels like I’ve got a war in my mind\nI want to get off but I keep ridin' the ride",
            "verified": false,
            "votes_total": 24,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "The one in and around you",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "This line goes hand in hand with the previous lyric: “I’ve heard the war was over if you really choose.” Lana compares conflict in the wider world with inner turmoil. Many songs on Norman Fucking Rockwell explore the theme of the inescapability of oneself, such as these lines from “Fuck it I love you”:\n\nI moved to California, but it’s just a state of mind\nIt turns out everywhere you go, you take yourself, that’s not a lie\n\nThe only way to, figuratively, escape feeling trapped is to recognize that you’re stuck as you. But that isn’t the end of the world – you can always improve yourself and choose to finally face your inner battles.",
            "verified": false,
            "votes_total": 8,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 3,
        "text": "You hate the heat, you got the blues\nChanging like the weather, oh, that's so like you\nThe Santa Ana moves you",
        "range": {
          "start": 3,
          "end": 5
        },
        "annotations": [
          {
            "text": "Lana draws parallels to multiple lines of Ultraviolence’s track number three, Shades of Cool.\n\n\nMy baby lives in shades of blue\nBlue eyes and jazz and attitude\nHe lives in California too\n\nBut I can’t fix him, can’t make him better\nAnd I can’t do nothing about his strange weather\n\n\nLana’s lover still has the blues, but by now he has evaded California. The most plausible reason for his departure could be that he no longer has the passion, or “heat”, that he needed for Lana and his relationship to succeed. His restlessness finally got the best of him, and thus led him to leave Lana and California.\n\nLana is very familiar with his hot-and-cold like attitude, but it doesn’t drive her away, as she continues to reassure him and tries to persuade him to contact her again.\n\nHer lover’s behavior is also compared to the Santa Ana, or more specifically, the Santa Ana winds, which are strong winds that originate from the inland and often make wildfires worse, especially in the Southern California area. In an essay titled The Santa Ana by American essayist Joan Didion, it is believed that the Santa Ana winds are to be the cause of some anxiety and temperamental problems for a few Southern Californians. Lana’s lover changes with the weather and feels uneasy about their relationship.",
            "verified": false,
            "votes_total": 63,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "'Cause this is crazy love, I'll catch you on the flip side",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "An expression commonly used in the 70s to say ‘See you when you/I get back!’ or ‘See you later!’. It’s also a direct reference to Lana’s 2014 song “Flipside”.\n\n​Maybe on the flipside I could catch you again\n\nAlso, the flip side is a phrase originating from the idea of when a radio dies would play an album through and the only time they would be heard from is when they are flipping the vinyl, “see you on the flip side”.",
            "verified": false,
            "votes_total": 80,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "If you come back to California, you should just hit me up\nWe'll do whatever you want, travel wherever how far\nWe'll hit up all the old places\nWe'll have a party, we'll dance 'til dawn\nI'll pick up all of your Vogues and all of your Rolling Stones\nYour favorite liquor off the top shelf\nI'll throw a party all night long",
        "range": {
          "start": 2,
          "end": 8
        },
        "annotations": [
          {
            "text": "Lana is referencing Joni Mitchell’s 1971 song “California” which is about her spending some time in Europe before coming back home to California:\n\nReading Rolling Stone, reading Vogue\nThey said, “How long can you hang around?”\nI said a week, maybe two\nJust until my skin turns brown\nThen I’m going home to California\nCalifornia, I’m coming home\nOh, will you take me as I am\nStrung out on another man\nCalifornia, I’m coming home\n\nLana’s putting a spin on Joni Mitchell’s story by singing this song from the point-of-view of an old friend or ex-lover who is welcoming the person to California. She’s likely referring to her ex-boyfriend, Scottish singer-songwriter, Barrie-James O'Neill, who contributed to her 2014 album Ultraviolence.\nEarlier in the verse, she promises to meet him in America if he returns from the UK (where O'Neill is located).\n\n“Your favorite liquor off the top shelf” might be a reference to her song “Carmen” from her debut album Born to Die in which she sings:\n\nDarling, darling\nDoesn’t have a problem lying to herself\n‘Cause her liquor’s top shelf",
            "verified": false,
            "votes_total": 64,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Outro",
    "lines": [
      {
        "id": 1,
        "text": "'Cause this is crazy love, I'll catch you on the flip side",
        "range": {
          "start": 1,
          "end": 1
        },
        "annotations": [
          {
            "text": "An expression commonly used in the 70s to say ‘See you when you/I get back!’ or ‘See you later!’. It’s also a direct reference to Lana’s 2014 song “Flipside”.\n\n​Maybe on the flipside I could catch you again\n\nAlso, the flip side is a phrase originating from the idea of when a radio dies would play an album through and the only time they would be heard from is when they are flipping the vinyl, “see you on the flip side”.",
            "verified": false,
            "votes_total": 80,
            "pinnedRole": null
          }
        ]
      },
      {
        "id": 2,
        "text": "If you come back to California, you should just hit me up",
        "range": {
          "start": 2,
          "end": 2
        },
        "annotations": [
          {
            "text": "This could be perceived as an allusion or a metaphor to Hotel California by the Eagles. Lana references the song in her discography in Honeymoon’s “God Knows I Tried” and in the “Did you know that there’s a tunnel under Ocean Blvd? title track.\n\nHotel California is a metaphor for the lifestyle of fame and indulgence that takes place in Hollywood. Lana could be alluding to this friend being someone who left the spotlight and that lifestyle. She is longing for them to come back, almost selfishly, – as she is trapped and immersed in the lifestyle.",
            "verified": false,
            "votes_total": 0,
            "pinnedRole": null
          }
        ]
      }
    ]
  }
]