[
  {
    "type": "Verse 1",
    "lines": [
      {
        "id": 1,
        "text": "\"What's wrong?\"\nYou've been asking, but I don't have an answer\n\"How come?\"",
        "range": {
          "start": 1,
          "end": 3
        },
        "annotations": [
          {
            "text": "When I wrote these lyrics, I imagined a couple laying in bed getting ready to fall asleep, and one of them is like, “What’s wrong?” Other person is thinking and they don’t really know what to say. And, to me, they do know what they want to say but they’re just going to lie until… Just kind of shove those emotions, the general emotions of the feeling of the song, way deep down because they don’t want to cause problems, and they’re just confused. That’s sort of what it means to me. Like not having an answer is just a lie, because you know exactly how you feel secretly. Lies.",
            "verified": true,
            "votes_total": 131,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 2,
        "text": "I'm still thinking, let's pretend to fall asleep now",
        "range": {
          "start": 4,
          "end": 4
        },
        "annotations": [
          {
            "text": "The idea of Clairo singing those two lines is because the question coming from her. If you’re in a relationship with someone, and let’s say, you’re sleeping with them or going to bed with them, if there’s very serious things and concerns on your mind, they can definitely keep you up at night. So, if you’re right next to the person, a good way to avoid talking about things that you should talk about is sleeping or just going to bed or shutting it out completely. And, that’s definitely a reflection of that in the verse and I liked the back and forth between the two.",
            "verified": true,
            "votes_total": 48,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 3,
        "text": "When we get old, will we regret this?\nToo young to think about all that shit",
        "range": {
          "start": 5,
          "end": 6
        },
        "annotations": [
          {
            "text": "It’s the idea of this relationship has already taken up a big amount of time, especially for us being young and that’s a big portion of our lives. And, if this goes on and we don’t have other experiences that we feel like we should have, we eventually realize that we want those experiences and we end this further down the line, and we’re farther into our life. We feel like this was all a waste of time because then you’re older and in a position where you’re trying to accomplish things that you wanted to do when you were younger, and that’s sort of where the regret comes from. It’s like if you regret that you wasted a bunch of time.\n\nIn reality, any relationship with anyone is a learning experience. I don’t think it’s ever time wasted because you learn from all those experiences. But, those are the kind of things that can torment you, and you go through, emotionally, in your mind, in any relationship. I feel like a lot of people go through a version of that in relationships.",
            "verified": true,
            "votes_total": 54,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 4,
        "text": "And stalling only goes so far when you've got a head start",
        "range": {
          "start": 7,
          "end": 7
        },
        "annotations": [
          {
            "text": "It’s kind of confusing because stalling and then head start, it kind of is contradicting itself. It’s like a weird paradoxical statement. But, what it means to me, when I was writing it, is that you have all these insecurities in a young relationship about the future. And you stall it and you stall saying things and you stall ending it or whatever. But, secretly, if you find yourself interested in somebody else at some point while you’re still with this other person, which is a very selfish thing to do, that’ll make that process of exposing whatever feelings to let this person go. And, you’ll feel more comfortable in a relationship instead of just confronting your feelings ahead of time on your own completely.\n\nLike, another relationship, that’s the head start. Someone else, someone new, and then, stalling. It’ll be possible because you already have something else in the works. So that’s what it means to me. It’s kind of like an evil, sinister sentiment, but it can be true. If you can look ahead and not feel like you’re going to be alone, then it’s easier to end what you’re currently in.",
            "verified": true,
            "votes_total": 42,
            "pinnedRole": "Artist"
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "'Cause we could stay at home orwatch the sunset\nBut I can't help from asking,\"Are you bored yet?\"",
        "range": {
          "start": 1,
          "end": 2
        },
        "annotations": [
          {
            "text": "It’s like, we could do this very mundane thing, or we could do this most clichéd romantic thing. So, the mundane thing is stay at home. Romantic thing, that we could do, is watch the sunset. I wanted that to be sort of a cliché right there. It’s like, we could do whatever, but, I can’t get this question off my brain. Which is, “But, I can’t help from asking, are you bored yet?” And asking if this other person is bored, in any elements of this relationship, in any sense of the word. It’s saying no matter what we do, I can’t get this off my mind.",
            "verified": true,
            "votes_total": 90,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 2,
        "text": "And if you're feeling lonely,you should tell me\nBefore this ends up asanother memory",
        "range": {
          "start": 3,
          "end": 4
        },
        "annotations": [
          {
            "text": "I think there’s a lot of confusion, in being in your youth. And, especially being a youth in a relationship with someone. Really, what this person is asking in the song, what he’s not sure of, is in himself. It’s like, “I’m feeling lonely. I’m feeling bored. I’m feeling nervous of the future. I’m feeling this is nearing it’s end.” And, it’s sort of like, “Are you feeling this way?” It’s sort of, hoping that they feel that way, too.\n\nit’s like, “I really hope you feel this way, so, it’s not just me, and I don’t have to keep pretending”. That’s where “If you are feeling lonely, you should tell me” comes from. Because, in his mind, it’s going, “I feel this way, too. Just say it, before this is just a memory. Maybe if you tell me now, we can talk about this together, we can work it out, for all I know”.",
            "verified": true,
            "votes_total": 62,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 3,
        "text": "Will you tell the truth so I don't have to lie?\nWill you tell the truth so I don't have to lie?",
        "range": {
          "start": 5,
          "end": 6
        },
        "annotations": [
          {
            "text": "It’s that same sentiment as the last line. It’s like, “Will you tell your truth, so I don’t have to keep lying about mine..” And, it’s hoping that your truth, is the same as mine. So, that we can either come to an agreement that this isn’t working or we can at least talk this out. Either way, I’m struggling, wondering if it’s my own thoughts, and I can’t bring it up, so please, can you? Like, I don’t have the guts to bring it up, so I really hope you can.",
            "verified": true,
            "votes_total": 79,
            "pinnedRole": "Artist"
          }
        ]
      }
    ]
  },
  {
    "type": "Verse 2",
    "lines": [
      {
        "id": 1,
        "text": "Feels like I've known you my whole life\nI can see right through your lies\nI don't know where we're going\nBut I'd like to be by your side\nIf you could tell me how you're feeling\nMaybe we'd get through this undefeated\nHolding on for so long",
        "range": {
          "start": 1,
          "end": 7
        },
        "annotations": [
          {
            "text": "Narratively, Clairo acts as the second person in the relationship that “Are You Bored Yet?” depicts. Writer Dylan Minnette reflected on Clairo’s contribution:\n\nFor Claire’s part, she came in and wrote at the studio… I look at her part as the other person, the other side of the relationship in the second verse. That point of view is way more optimistic: ‘This can work out. We can get through this undefeated.’ But the narrator of the song is too far gone.",
            "verified": false,
            "votes_total": 86,
            "pinnedRole": null
          }
        ]
      }
    ]
  },
  {
    "type": "Chorus",
    "lines": [
      {
        "id": 1,
        "text": "'Cause we could stay at home orwatch the sunset\nBut I can't help from asking,\"Are you bored yet?\"",
        "range": {
          "start": 1,
          "end": 2
        },
        "annotations": [
          {
            "text": "It’s like, we could do this very mundane thing, or we could do this most clichéd romantic thing. So, the mundane thing is stay at home. Romantic thing, that we could do, is watch the sunset. I wanted that to be sort of a cliché right there. It’s like, we could do whatever, but, I can’t get this question off my brain. Which is, “But, I can’t help from asking, are you bored yet?” And asking if this other person is bored, in any elements of this relationship, in any sense of the word. It’s saying no matter what we do, I can’t get this off my mind.",
            "verified": true,
            "votes_total": 90,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 2,
        "text": "And if you're feeling lonely,you should tell me\nBefore this ends up asanother memory",
        "range": {
          "start": 3,
          "end": 4
        },
        "annotations": [
          {
            "text": "I think there’s a lot of confusion, in being in your youth. And, especially being a youth in a relationship with someone. Really, what this person is asking in the song, what he’s not sure of, is in himself. It’s like, “I’m feeling lonely. I’m feeling bored. I’m feeling nervous of the future. I’m feeling this is nearing it’s end.” And, it’s sort of like, “Are you feeling this way?” It’s sort of, hoping that they feel that way, too.\n\nit’s like, “I really hope you feel this way, so, it’s not just me, and I don’t have to keep pretending”. That’s where “If you are feeling lonely, you should tell me” comes from. Because, in his mind, it’s going, “I feel this way, too. Just say it, before this is just a memory. Maybe if you tell me now, we can talk about this together, we can work it out, for all I know”.",
            "verified": true,
            "votes_total": 62,
            "pinnedRole": "Artist"
          }
        ]
      },
      {
        "id": 3,
        "text": "Will you tell the truth so I don't have to lie?\nWill you tell the truth so I don't have to lie?",
        "range": {
          "start": 5,
          "end": 6
        },
        "annotations": [
          {
            "text": "It’s that same sentiment as the last line. It’s like, “Will you tell your truth, so I don’t have to keep lying about mine..” And, it’s hoping that your truth, is the same as mine. So, that we can either come to an agreement that this isn’t working or we can at least talk this out. Either way, I’m struggling, wondering if it’s my own thoughts, and I can’t bring it up, so please, can you? Like, I don’t have the guts to bring it up, so I really hope you can.",
            "verified": true,
            "votes_total": 79,
            "pinnedRole": "Artist"
          }
        ]
      }
    ]
  }
]